# SİHA-YOLOv8 V4 — Tam Mimari (P2 Head + Tum Moduller)
# ====================================================================
#
# Versiyon: V4 (full pipeline — Hybrid Loss + ASFF + BiFPN + SimAM)
#
# BACKBONE: LEM, DSConv, DilatedConv, SwinC2f, C2f, SPPF
# NECK:     BiFPN (BiFPNAdd), SimAM, CSSF, FFM, ASFF
# HEAD:     4 kafa (P2, P3, P4, P5) — stride 4, 8, 16, 32
#
# Toplam 44 layer  |  Scales: n / s / m
# ====================================================================
#
# nc TUTARLILIK NOTU:
#   Model YAML nc=1  ←→  data.yaml nc=1 names=['UAV']  ←→  config single_cls=True
#   Tüm üçü TEK SINIF UAV deteksiyonu için hizalanmıştır.
#   Eğer gelecekte çok sınıf eklenmek istenirse:
#     1. Buradaki nc değerini artır
#     2. data.yaml nc + names listesini güncelle
#     3. config.py single_cls = False yap
# ====================================================================

nc: 1  # TEK SINIF: UAV — data.yaml ve config.single_cls ile tutarlı

scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]

# ====================================================================
# BACKBONE (11 layer, idx 0-10)
# ====================================================================
backbone:
  - [-1, 1, Conv, [64, 3, 2]]              # 0: Stem P1/2 → 320×320
  - [-1, 1, LEM, [128, 3, 2]]              # 1: P2/4 → 160×160  (hafif downsample)
  - [-1, 3, C2f, [128, True]]              # 2: P2 özellikleri  ← HEAD REF
  - [-1, 1, LEM, [256, 3, 2]]              # 3: P3/8 → 80×80   (hafif downsample)
  - [-1, 6, C2f, [256, True]]              # 4: P3 özellikleri  ← HEAD REF
  - [-1, 1, DSConv, [512, 3, 2]]           # 5: P4/16 → 40×40  (yapısal detay)
  - [-1, 6, C2f, [512, True]]              # 6: P4 özellikleri
  - [-1, 1, DilatedConv, [512, 3, 1, 2]]   # 7: P4 receptive field genişletme ← HEAD REF
  - [-1, 1, Conv, [1024, 3, 2]]            # 8: P5/32 → 20×20
  - [-1, 1, SwinC2f, [1024, 8, 1]]         # 9: Global bağlam (transformer)
  - [-1, 1, SPPF, [1024, 5]]               # 10: Spatial Pyramid Pooling ← HEAD REF

# ====================================================================
# HEAD (33 layer, idx 11-43)
# ====================================================================
head:
  # ── Top-Down: P5 → P4 ──────────────────────────────────────
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]     # 11
  - [-1, 1, Conv, [512, 1, 1]]                     # 12: proj
  - [[-1, 7], 1, BiFPNAdd, [2]]                    # 13: fuse(P5_up, P4_dilated)
  - [-1, 3, C2f, [512]]                             # 14: P4 fused
  - [-1, 1, SimAM, []]                              # 15: attention

  # ── Top-Down: P4 → P3 ──────────────────────────────────────
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]     # 16
  - [-1, 1, Conv, [256, 1, 1]]                     # 17: proj
  - [[-1, 4], 1, BiFPNAdd, [2]]                    # 18: fuse(P4_up, backbone_P3)
  - [-1, 3, C2f, [256]]                             # 19: P3 fused
  - [-1, 1, SimAM, []]                              # 20: attention

  # ── Top-Down: P3 → P2 ──────────────────────────────────────
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]     # 21
  - [-1, 1, Conv, [128, 1, 1]]                     # 22: proj
  - [[-1, 2], 1, BiFPNAdd, [2]]                    # 23: fuse(P3_up, backbone_P2)
  - [-1, 3, C2f, [128]]                             # 24: P2 fused
  - [-1, 1, SimAM, []]                              # 25: attention

  # ── CSSF: P5 → P2 doğrudan skip füzyonu ────────────────────
  - [[10, 25], 1, CSSF, []]                         # 26: P5(SPPF) → P2 köprü

  # ── Bottom-Up: P2 → P3 + FFM ───────────────────────────────
  - [-1, 1, Conv, [256, 3, 2]]                     # 27: downsample
  - [[-1, 19], 1, BiFPNAdd, [2]]                   # 28: fuse(P2_down, TD_P3)
  - [-1, 3, C2f, [256]]                             # 29
  - [[-1, 4], 1, FFM, []]                           # 30: FFM(neck_P3, backbone_P3)

  # ── Bottom-Up: P3 → P4 + FFM ───────────────────────────────
  - [-1, 1, Conv, [512, 3, 2]]                     # 31: downsample
  - [[-1, 14], 1, BiFPNAdd, [2]]                   # 32: fuse(P3_down, TD_P4)
  - [-1, 3, C2f, [512]]                             # 33
  - [[-1, 7], 1, FFM, []]                           # 34: FFM(neck_P4, backbone_P4_dilated)

  # ── Bottom-Up: P4 → P5 + FFM ───────────────────────────────
  - [-1, 1, Conv, [1024, 3, 2]]                    # 35: downsample
  - [[-1, 10], 1, BiFPNAdd, [2]]                   # 36: fuse(P4_down, SPPF)
  - [-1, 3, C2f, [1024]]                            # 37
  - [[-1, 10], 1, FFM, []]                          # 38: FFM(neck_P5, SPPF)

  # ── ASFF: Adaptive füzyon (Detect öncesi) ──────────────────
  - [[26, 30, 34, 38], 1, ASFF, [0]]               # 39: ASFF P2
  - [[26, 30, 34, 38], 1, ASFF, [1]]               # 40: ASFF P3
  - [[26, 30, 34, 38], 1, ASFF, [2]]               # 41: ASFF P4
  - [[26, 30, 34, 38], 1, ASFF, [3]]               # 42: ASFF P5

  # ── 4 Başlı Tespit ─────────────────────────────────────────
  - [[39, 40, 41, 42], 1, Detect, [nc]]            # 43: P2+P3+P4+P5
