# SİHA-YOLOv8 — P2 Head (4 Tespit Kafası) Model Konfigürasyonu
# ==============================================================
#
# Standart YOLOv8:  3 kafa (P3, P4, P5) → stride 8, 16, 32
# SİHA-YOLOv8:     4 kafa (P2, P3, P4, P5) → stride 4, 8, 16, 32
#
# P2 eklenmesinin amacı:
#   - P2 özellik haritası 160×160 (640 girişte) → en yüksek çözünürlük
#   - Birkaç piksellik küçük nesneleri (uzaktaki İHA) yakalayabilir
#   - MSW-YOLO makalesinde VisDrone'da ciddi mAP artışı kanıtlanmış
#
# UYARI: P2 Head bellek kullanımını artırır!
#   - Standart:  8400 anchor nokta
#   - P2 ekli:  34000 anchor nokta (~4x artış)
#   - Kaggle T4 (16GB) için yolov8n (nano) ölçeği önerilir
#
# Kullanım:
#   from ultralytics import YOLO
#   model = YOLO('siha_yolov8_p2.yaml').load('yolov8n.pt')

# Sınıf sayısı — data.yaml'dan override edilir
nc: 8

# Ölçek çarpanları [depth, width, max_channels]
# n=nano → Kaggle T4 uyumlu, hafif ama P2 ile güçlü
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]

# ====================================================================
# BACKBONE — Özellik çıkarım omurgası (standart YOLOv8 ile aynı)
# ====================================================================
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]       # 0: P1/2   → 320×320
  - [-1, 1, Conv, [128, 3, 2]]      # 1: P2/4   → 160×160
  - [-1, 3, C2f, [128, True]]       # 2: P2 özellikleri ← P2 HEAD BURADAN BESLENECEK
  - [-1, 1, Conv, [256, 3, 2]]      # 3: P3/8   → 80×80
  - [-1, 6, C2f, [256, True]]       # 4: P3 özellikleri
  - [-1, 1, Conv, [512, 3, 2]]      # 5: P4/16  → 40×40
  - [-1, 6, C2f, [512, True]]       # 6: P4 özellikleri
  - [-1, 1, Conv, [1024, 3, 2]]     # 7: P5/32  → 20×20
  - [-1, 1, SwinC2f, [1024, 8, 1]]  # 8: Swin-C2f (son blok, global bağlam)
  - [-1, 1, SPPF, [1024, 5]]        # 9: SPPF (Spatial Pyramid Pooling)

# ====================================================================
# HEAD — Top-Down + Bottom-Up FPN/PAN ile P2 Head
# ====================================================================
head:
  # ── Top-Down Yolu (FPN — yüksek seviye bilgiyi aşağıya taşır) ──

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 10: P5 → P4 boyutuna
  - [-1, 1, Conv, [512, 1, 1]]                   # 11: P5_up proj → 512 (BiFPN)
  - [[-1, 6], 1, BiFPNAdd, [2]]                  # 12: weighted fuse (P5_up, P4)
  - [-1, 3, C2f, [512]]                           # 13: P4 fused
  - [-1, 1, SimAM, []]                            # 14: attention (parametresiz)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 15: P4 → P3 boyutuna
  - [-1, 1, Conv, [256, 1, 1]]                   # 16: P4_up proj → 256 (BiFPN)
  - [[-1, 4], 1, BiFPNAdd, [2]]                  # 17: weighted fuse (P4_up, P3)
  - [-1, 3, C2f, [256]]                           # 18: P3 fused
  - [-1, 1, SimAM, []]                            # 19: attention (parametresiz)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 20: P3 → P2 boyutuna     ← YENİ
  - [-1, 1, Conv, [128, 1, 1]]                   # 21: P3_up proj → 128 (BiFPN)
  - [[-1, 2], 1, BiFPNAdd, [2]]                  # 22: weighted fuse (P3_up, P2)
  - [-1, 3, C2f, [128]]                           # 23: P2 fused             ← YENİ
  - [-1, 1, SimAM, []]                            # 24: attention (parametresiz)

  # ── Bottom-Up Yolu (PAN — düşük seviye detayı yukarıya taşır) ──

  - [-1, 1, Conv, [256, 3, 2]]                    # 25: P2 → P3 boyutuna (BiFPN)
  - [[-1, 18], 1, BiFPNAdd, [2]]                  # 26: weighted fuse (P2_down, P3)
  - [-1, 3, C2f, [256]]                           # 27: P3 final

  - [-1, 1, Conv, [512, 3, 2]]                    # 28: P3 → P4 boyutuna (BiFPN)
  - [[-1, 13], 1, BiFPNAdd, [2]]                  # 29: weighted fuse (P3_down, P4)
  - [-1, 3, C2f, [512]]                           # 30: P4 final

  - [-1, 1, Conv, [1024, 3, 2]]                   # 31: P4 → P5 boyutuna (BiFPN)
  - [[-1, 9], 1, BiFPNAdd, [2]]                   # 32: weighted fuse (P4_down, P5 SPPF)
  - [-1, 3, C2f, [1024]]                          # 33: P5 final

  # ── 4 Başlı Tespit (P2 + P3 + P4 + P5) ──

  - [[23, 27, 30, 33], 1, Detect, [nc]]           # 34: 4-head detect
  #   P2 (stride 4):  küçük nesneler — uzaktaki İHA
  #   P3 (stride 8):  küçük-orta nesneler
  #   P4 (stride 16): orta nesneler
  #   P5 (stride 32): büyük nesneler
